---
kind: property
id: P:Autodesk.Revit.UI.UIControlledApplication.LoadedApplications
source: html/1492b595-f8d9-ff0f-e936-806af51a167d.htm
---
# Autodesk.Revit.UI.UIControlledApplication.LoadedApplications Property

Returns an array of successfully loaded external applications.

## Syntax (C#)
```csharp
public virtual ExternalApplicationArray LoadedApplications { get; }
```

## Remarks
This property can be used by your application to find all successfully
loaded external applications when Revit starts.